	package 형변환;

public class 기본형형변환 {

	public static void main(String[] args) {
		byte n1 = 100;  //1바이트  -128~127 까지가 범위임
		int n2=n1;  // 4바이트
		//큰<-작 작은애가 큰데로 들어가면 자동으로 int 로 변환되어 들어감
		// 타입변환(자동 형변환이라고 부름, 자동캐스팅(던져졌다) 
		
		byte n3 = (byte)n2; // 에러가발생하는이유는?  1바이트<-4바이트 
		// 작<-큰 (강제로 byte로 변환되어야 들어갈 수 있음) 자동으로안됨 얘는 
		//타입변환(강제 형변환, 강제캐스팅)  (바꾸고싶은 타입을 이용)소괄호를 이용한다.
		
		int n4= 2000;
		byte n5= (byte)n4;  //문법적으로 이상은없어보이나 바이트라는 범위안에 2000 이 들어갈수가없으므로 
		//들어갈 수없는 값의 범주에 강제캐스팅하는 경우는
		//엉뚱한 값이 들어가므로 불가! 
		
		
		
	}

}
